Tarea #995/haproxylb/containerized/resultados_ab.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Apache/2.4.62
Server Hostname:        localhost
Server Port:            80

Document Path:          /
Document Length:        49620 bytes

Concurrency Level:      500
Time taken for tests:   51.495 seconds
Complete requests:      4000
Failed requests:        3430
   (Connect: 0, Receive: 0, Length: 3430, Exceptions: 0)
Total transferred:      40530390 bytes
HTML transferred:       39537230 bytes
Requests per second:    77.68 [#/sec] (mean)
Time per request:       6436.932 [ms] (mean)
Time per request:       12.874 [ms] (mean, across all concurrent requests)
Transfer rate:          768.62 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3   7.1      0      44
Processing:    17 5589 6633.1   3006   44281
Waiting:       17 5523 6466.8   3005   43948
Total:         17 5592 6635.8   3006   44295

Percentage of the requests served within a certain time (ms)
  50%   3006
  66%   4481
  75%   6442
  80%   8460
  90%  12279
  95%  19808
  98%  29262
  99%  34611
 100%  44295 (longest request)